grevaillot/svd_tools/headers/STM32H7B3x/dma1.h
/** @defgroup dma1_s4par S4PAR stream x peripheral address register
@{*/


#define DMA1_S4PAR_PA_SHIFT		0
#define DMA1_S4PAR_PA_MASK		0xffffffff
/** @defgroup dma1_s4par_pa PA Peripheral address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s4m0ar S4M0AR stream x memory 0 address register
@{*/


#define DMA1_S4M0AR_M0A_SHIFT		0
#define DMA1_S4M0AR_M0A_MASK		0xffffffff
/** @defgroup dma1_s4m0ar_m0a M0A Memory 0 address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s4m1ar S4M1AR stream x memory 1 address register
@{*/


#define DMA1_S4M1AR_M1A_SHIFT		0
#define DMA1_S4M1AR_M1A_MASK		0xffffffff
/** @defgroup dma1_s4m1ar_m1a M1A Memory 1 address (used in case of Double buffer mode)
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s4fcr S4FCR stream x FIFO control register
@{*/

/** DMA1_S4FCR_FEIE FIFO error interrupt enable **/
#define DMA1_S4FCR_FEIE		(1 << 7)

#define DMA1_S4FCR_FS_SHIFT		3
#define DMA1_S4FCR_FS_MASK		0x07
/** @defgroup dma1_s4fcr_fs FS FIFO status
@{*/
/**@}*/

/** DMA1_S4FCR_DMDIS Direct mode disable **/
#define DMA1_S4FCR_DMDIS		(1 << 2)

#define DMA1_S4FCR_FTH_SHIFT		0
#define DMA1_S4FCR_FTH_MASK		0x03
/** @defgroup dma1_s4fcr_fth FTH FIFO threshold selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s5cr S5CR stream x configuration register
@{*/


#define DMA1_S5CR_MBURST_SHIFT		23
#define DMA1_S5CR_MBURST_MASK		0x03
/** @defgroup dma1_s5cr_mburst MBURST Memory burst transfer configuration
@{*/
/**@}*/


#define DMA1_S5CR_PBURST_SHIFT		21
#define DMA1_S5CR_PBURST_MASK		0x03
/** @defgroup dma1_s5cr_pburst PBURST Peripheral burst transfer configuration
@{*/
/**@}*/

/** DMA1_S5CR_ACK ACK **/
#define DMA1_S5CR_ACK		(1 << 20)
/** DMA1_S5CR_CT Current target (only in double buffer mode) **/
#define DMA1_S5CR_CT		(1 << 19)
/** DMA1_S5CR_DBM Double buffer mode **/
#define DMA1_S5CR_DBM		(1 << 18)

#define DMA1_S5CR_PL_SHIFT		16
#define DMA1_S5CR_PL_MASK		0x03
/** @defgroup dma1_s5cr_pl PL Priority level
@{*/
/**@}*/

/** DMA1_S5CR_PINCOS Peripheral increment offset size **/
#define DMA1_S5CR_PINCOS		(1 << 15)

#define DMA1_S5CR_MSIZE_SHIFT		13
#define DMA1_S5CR_MSIZE_MASK		0x03
/** @defgroup dma1_s5cr_msize MSIZE Memory data size
@{*/
/**@}*/


#define DMA1_S5CR_PSIZE_SHIFT		11
#define DMA1_S5CR_PSIZE_MASK		0x03
/** @defgroup dma1_s5cr_psize PSIZE Peripheral data size
@{*/
/**@}*/

/** DMA1_S5CR_MINC Memory increment mode **/
#define DMA1_S5CR_MINC		(1 << 10)
/** DMA1_S5CR_PINC Peripheral increment mode **/
#define DMA1_S5CR_PINC		(1 << 9)
/** DMA1_S5CR_CIRC Circular mode **/
#define DMA1_S5CR_CIRC		(1 << 8)

#define DMA1_S5CR_DIR_SHIFT		6
#define DMA1_S5CR_DIR_MASK		0x03
/** @defgroup dma1_s5cr_dir DIR Data transfer direction
@{*/
/**@}*/

/** DMA1_S5CR_PFCTRL Peripheral flow controller **/
#define DMA1_S5CR_PFCTRL		(1 << 5)
/** DMA1_S5CR_TCIE Transfer complete interrupt enable **/
#define DMA1_S5CR_TCIE		(1 << 4)
/** DMA1_S5CR_HTIE Half transfer interrupt enable **/
#define DMA1_S5CR_HTIE		(1 << 3)
/** DMA1_S5CR_TEIE Transfer error interrupt enable **/
#define DMA1_S5CR_TEIE		(1 << 2)
/** DMA1_S5CR_DMEIE Direct mode error interrupt enable **/
#define DMA1_S5CR_DMEIE		(1 << 1)
/** DMA1_S5CR_EN Stream enable / flag stream ready when read low **/
#define DMA1_S5CR_EN		(1 << 0)

/**@}*/

/** @defgroup dma1_s5ndtr S5NDTR stream x number of data register
@{*/


#define DMA1_S5NDTR_NDT_SHIFT		0
#define DMA1_S5NDTR_NDT_MASK		0xffff
/** @defgroup dma1_s5ndtr_ndt NDT Number of data items to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s5par S5PAR stream x peripheral address register
@{*/


#define DMA1_S5PAR_PA_SHIFT		0
#define DMA1_S5PAR_PA_MASK		0xffffffff
/** @defgroup dma1_s5par_pa PA Peripheral address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s5m0ar S5M0AR stream x memory 0 address register
@{*/


#define DMA1_S5M0AR_M0A_SHIFT		0
#define DMA1_S5M0AR_M0A_MASK		0xffffffff
/** @defgroup dma1_s5m0ar_m0a M0A Memory 0 address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s5m1ar S5M1AR stream x memory 1 address register
@{*/


#define DMA1_S5M1AR_M1A_SHIFT		0
#define DMA1_S5M1AR_M1A_MASK		0xffffffff
/** @defgroup dma1_s5m1ar_m1a M1A Memory 1 address (used in case of Double buffer mode)
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s5fcr S5FCR stream x FIFO control register
@{*/

/** DMA1_S5FCR_FEIE FIFO error interrupt enable **/
#define DMA1_S5FCR_FEIE		(1 << 7)

#define DMA1_S5FCR_FS_SHIFT		3
#define DMA1_S5FCR_FS_MASK		0x07
/** @defgroup dma1_s5fcr_fs FS FIFO status
@{*/
/**@}*/

/** DMA1_S5FCR_DMDIS Direct mode disable **/
#define DMA1_S5FCR_DMDIS		(1 << 2)

#define DMA1_S5FCR_FTH_SHIFT		0
#define DMA1_S5FCR_FTH_MASK		0x03
/** @defgroup dma1_s5fcr_fth FTH FIFO threshold selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s6cr S6CR stream x configuration register
@{*/


#define DMA1_S6CR_MBURST_SHIFT		23
#define DMA1_S6CR_MBURST_MASK		0x03
/** @defgroup dma1_s6cr_mburst MBURST Memory burst transfer configuration
@{*/
/**@}*/


#define DMA1_S6CR_PBURST_SHIFT		21
#define DMA1_S6CR_PBURST_MASK		0x03
/** @defgroup dma1_s6cr_pburst PBURST Peripheral burst transfer configuration
@{*/
/**@}*/

/** DMA1_S6CR_ACK ACK **/
#define DMA1_S6CR_ACK		(1 << 20)
/** DMA1_S6CR_CT Current target (only in double buffer mode) **/
#define DMA1_S6CR_CT		(1 << 19)
/** DMA1_S6CR_DBM Double buffer mode **/
#define DMA1_S6CR_DBM		(1 << 18)

#define DMA1_S6CR_PL_SHIFT		16
#define DMA1_S6CR_PL_MASK		0x03
/** @defgroup dma1_s6cr_pl PL Priority level
@{*/
/**@}*/

/** DMA1_S6CR_PINCOS Peripheral increment offset size **/
#define DMA1_S6CR_PINCOS		(1 << 15)

#define DMA1_S6CR_MSIZE_SHIFT		13
#define DMA1_S6CR_MSIZE_MASK		0x03
/** @defgroup dma1_s6cr_msize MSIZE Memory data size
@{*/
/**@}*/


#define DMA1_S6CR_PSIZE_SHIFT		11
#define DMA1_S6CR_PSIZE_MASK		0x03
/** @defgroup dma1_s6cr_psize PSIZE Peripheral data size
@{*/
/**@}*/

/** DMA1_S6CR_MINC Memory increment mode **/
#define DMA1_S6CR_MINC		(1 << 10)
/** DMA1_S6CR_PINC Peripheral increment mode **/
#define DMA1_S6CR_PINC		(1 << 9)
/** DMA1_S6CR_CIRC Circular mode **/
#define DMA1_S6CR_CIRC		(1 << 8)

#define DMA1_S6CR_DIR_SHIFT		6
#define DMA1_S6CR_DIR_MASK		0x03
/** @defgroup dma1_s6cr_dir DIR Data transfer direction
@{*/
/**@}*/

/** DMA1_S6CR_PFCTRL Peripheral flow controller **/
#define DMA1_S6CR_PFCTRL		(1 << 5)
/** DMA1_S6CR_TCIE Transfer complete interrupt enable **/
#define DMA1_S6CR_TCIE		(1 << 4)
/** DMA1_S6CR_HTIE Half transfer interrupt enable **/
#define DMA1_S6CR_HTIE		(1 << 3)
/** DMA1_S6CR_TEIE Transfer error interrupt enable **/
#define DMA1_S6CR_TEIE		(1 << 2)
/** DMA1_S6CR_DMEIE Direct mode error interrupt enable **/
#define DMA1_S6CR_DMEIE		(1 << 1)
/** DMA1_S6CR_EN Stream enable / flag stream ready when read low **/
#define DMA1_S6CR_EN		(1 << 0)

/**@}*/

/** @defgroup dma1_s6ndtr S6NDTR stream x number of data register
@{*/


