grevaillot/svd_tools/headers/STM32H7B3x/dma1.h
#define DMA1_S6NDTR_NDT_SHIFT		0
#define DMA1_S6NDTR_NDT_MASK		0xffff
/** @defgroup dma1_s6ndtr_ndt NDT Number of data items to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s6par S6PAR stream x peripheral address register
@{*/


#define DMA1_S6PAR_PA_SHIFT		0
#define DMA1_S6PAR_PA_MASK		0xffffffff
/** @defgroup dma1_s6par_pa PA Peripheral address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s6m0ar S6M0AR stream x memory 0 address register
@{*/


#define DMA1_S6M0AR_M0A_SHIFT		0
#define DMA1_S6M0AR_M0A_MASK		0xffffffff
/** @defgroup dma1_s6m0ar_m0a M0A Memory 0 address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s6m1ar S6M1AR stream x memory 1 address register
@{*/


#define DMA1_S6M1AR_M1A_SHIFT		0
#define DMA1_S6M1AR_M1A_MASK		0xffffffff
/** @defgroup dma1_s6m1ar_m1a M1A Memory 1 address (used in case of Double buffer mode)
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s6fcr S6FCR stream x FIFO control register
@{*/

/** DMA1_S6FCR_FEIE FIFO error interrupt enable **/
#define DMA1_S6FCR_FEIE		(1 << 7)

#define DMA1_S6FCR_FS_SHIFT		3
#define DMA1_S6FCR_FS_MASK		0x07
/** @defgroup dma1_s6fcr_fs FS FIFO status
@{*/
/**@}*/

/** DMA1_S6FCR_DMDIS Direct mode disable **/
#define DMA1_S6FCR_DMDIS		(1 << 2)

#define DMA1_S6FCR_FTH_SHIFT		0
#define DMA1_S6FCR_FTH_MASK		0x03
/** @defgroup dma1_s6fcr_fth FTH FIFO threshold selection
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s7cr S7CR stream x configuration register
@{*/


#define DMA1_S7CR_MBURST_SHIFT		23
#define DMA1_S7CR_MBURST_MASK		0x03
/** @defgroup dma1_s7cr_mburst MBURST Memory burst transfer configuration
@{*/
/**@}*/


#define DMA1_S7CR_PBURST_SHIFT		21
#define DMA1_S7CR_PBURST_MASK		0x03
/** @defgroup dma1_s7cr_pburst PBURST Peripheral burst transfer configuration
@{*/
/**@}*/

/** DMA1_S7CR_ACK ACK **/
#define DMA1_S7CR_ACK		(1 << 20)
/** DMA1_S7CR_CT Current target (only in double buffer mode) **/
#define DMA1_S7CR_CT		(1 << 19)
/** DMA1_S7CR_DBM Double buffer mode **/
#define DMA1_S7CR_DBM		(1 << 18)

#define DMA1_S7CR_PL_SHIFT		16
#define DMA1_S7CR_PL_MASK		0x03
/** @defgroup dma1_s7cr_pl PL Priority level
@{*/
/**@}*/

/** DMA1_S7CR_PINCOS Peripheral increment offset size **/
#define DMA1_S7CR_PINCOS		(1 << 15)

#define DMA1_S7CR_MSIZE_SHIFT		13
#define DMA1_S7CR_MSIZE_MASK		0x03
/** @defgroup dma1_s7cr_msize MSIZE Memory data size
@{*/
/**@}*/


#define DMA1_S7CR_PSIZE_SHIFT		11
#define DMA1_S7CR_PSIZE_MASK		0x03
/** @defgroup dma1_s7cr_psize PSIZE Peripheral data size
@{*/
/**@}*/

/** DMA1_S7CR_MINC Memory increment mode **/
#define DMA1_S7CR_MINC		(1 << 10)
/** DMA1_S7CR_PINC Peripheral increment mode **/
#define DMA1_S7CR_PINC		(1 << 9)
/** DMA1_S7CR_CIRC Circular mode **/
#define DMA1_S7CR_CIRC		(1 << 8)

#define DMA1_S7CR_DIR_SHIFT		6
#define DMA1_S7CR_DIR_MASK		0x03
/** @defgroup dma1_s7cr_dir DIR Data transfer direction
@{*/
/**@}*/

/** DMA1_S7CR_PFCTRL Peripheral flow controller **/
#define DMA1_S7CR_PFCTRL		(1 << 5)
/** DMA1_S7CR_TCIE Transfer complete interrupt enable **/
#define DMA1_S7CR_TCIE		(1 << 4)
/** DMA1_S7CR_HTIE Half transfer interrupt enable **/
#define DMA1_S7CR_HTIE		(1 << 3)
/** DMA1_S7CR_TEIE Transfer error interrupt enable **/
#define DMA1_S7CR_TEIE		(1 << 2)
/** DMA1_S7CR_DMEIE Direct mode error interrupt enable **/
#define DMA1_S7CR_DMEIE		(1 << 1)
/** DMA1_S7CR_EN Stream enable / flag stream ready when read low **/
#define DMA1_S7CR_EN		(1 << 0)

/**@}*/

/** @defgroup dma1_s7ndtr S7NDTR stream x number of data register
@{*/


#define DMA1_S7NDTR_NDT_SHIFT		0
#define DMA1_S7NDTR_NDT_MASK		0xffff
/** @defgroup dma1_s7ndtr_ndt NDT Number of data items to transfer
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s7par S7PAR stream x peripheral address register
@{*/


#define DMA1_S7PAR_PA_SHIFT		0
#define DMA1_S7PAR_PA_MASK		0xffffffff
/** @defgroup dma1_s7par_pa PA Peripheral address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s7m0ar S7M0AR stream x memory 0 address register
@{*/


#define DMA1_S7M0AR_M0A_SHIFT		0
#define DMA1_S7M0AR_M0A_MASK		0xffffffff
/** @defgroup dma1_s7m0ar_m0a M0A Memory 0 address
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s7m1ar S7M1AR stream x memory 1 address register
@{*/


#define DMA1_S7M1AR_M1A_SHIFT		0
#define DMA1_S7M1AR_M1A_MASK		0xffffffff
/** @defgroup dma1_s7m1ar_m1a M1A Memory 1 address (used in case of Double buffer mode)
@{*/
/**@}*/


/**@}*/

/** @defgroup dma1_s7fcr S7FCR stream x FIFO control register
@{*/

/** DMA1_S7FCR_FEIE FIFO error interrupt enable **/
#define DMA1_S7FCR_FEIE		(1 << 7)

#define DMA1_S7FCR_FS_SHIFT		3
#define DMA1_S7FCR_FS_MASK		0x07
/** @defgroup dma1_s7fcr_fs FS FIFO status
@{*/
/**@}*/

/** DMA1_S7FCR_DMDIS Direct mode disable **/
#define DMA1_S7FCR_DMDIS		(1 << 2)

#define DMA1_S7FCR_FTH_SHIFT		0
#define DMA1_S7FCR_FTH_MASK		0x03
/** @defgroup dma1_s7fcr_fth FTH FIFO threshold selection
@{*/
/**@}*/


/**@}*/
